[["1956-12-05 00:00:00", ["Mandela is among 156 resistance leaders arrested and charged with high treason."]], ["1960-03-21 00:00:00", ["In Sharpeville, police fire upon protestors challenging apartheid laws; 69 people are killed."]], ["1960-04-08 00:00:00", ["The ANC is banned nine days after Mandela is arrested and the government imposes a state of emergency after the events in Sharpeville."]], ["1961-03-29 00:00:00", ["Mandela and all co-defendants are found not guilty of treason."]], ["1962-08-05 00:00:00", ["Is arrested on charges of inciting workers to strike and leaving the country without valid travel documents.", "Mandela represents himself at trial."]], ["1962-11-07 00:00:00", ["Is sentenced to prison, five years hard labor."]], ["1964-06-12 00:00:00", ["Is sentenced to life in prison for four counts of sabotage.", "Convicted and sentenced with Mandela are Walter Sisulu, Ahmed Kathrada, Govan Mbeki, Denis Goldberg and others."]], ["1989-07-05 00:00:00", ["Meets with President P.W. Botha."]], ["1989-08-15 00:00:00", ["Botha resigns as president and head of the National Party.", "Frederik Willem de Klerk replaces him and begins dismantling apartheid."]], ["1989-12-13 00:00:00", ["Mandela and de Klerk meet for the first time."]], ["1990-02-11 00:00:00", ["Mandela is released from prison after more than 27 years."]], ["1994-04-29 00:00:00", ["Elected the first black president of the Republic of South Africa in the first open election in the country's history."]], ["1994-05-10 00:00:00", ["Mandela is inaugurated."]], ["2000-01-19 00:00:00", ["Addresses the UN Security Council, appealing for help in ending the brutal civil war between ethnic Hutus and Tutsis in Burundi."]], ["2001-07-25 00:00:00", ["Announces that he has prostate cancer and is undergoing treatment."]], ["2003-01-31 00:00:00", ["Mandela criticizes President George W. Bush's stance on Iraq, saying he has no foresight and can't think properly."]], ["2003-11-29 00:00:00", ["Aids awareness event, the 46664 Concert (Mandela's prison number) at Green Point stadium in Cape Town.", "The event draws 30,000+ fans with performances by Beyonce, Peter Gabriel, Bono, Bob Geldof and many more; and speeches by Mandela and Geldof."]], ["2003-12-01 00:00:00", ["Mandela participates in the signing of the Geneva Accords for peace in the Middle East."]], ["2005-01-07 00:00:00", ["Announces that his son, Makgatho Mandela, has died of AIDS and that the disease should be given publicity so that people will stop viewing it as extraordinary."]], ["2005-03-21 00:00:00", ["Hosts the \"46664 concert\" in George, South Africa, to promote AIDS awareness."]], ["2007-08-29 00:00:00", ["A bronze statue of Mandela is unveiled in Parliament Square in London."]], ["2008-06-27 00:00:00", ["A London concert is held at Hyde Park in honor of Mandela's 90th birthday (on July 18) with all proceeds going to an AIDS charity.", "It is estimated that about 40,000 tickets were sold."]], ["2009-07-18 00:00:00", ["The Nelson Mandela Foundation creates Mandela Day to be held every year on his birthday.", "The purpose of the day is to bring awareness to community service."]], ["2009-11-11 00:00:00", ["The United Nations declares July 18th Nelson Mandela International Day."]], ["2009-12-11 00:00:00", ["The movie Invictus, starring Morgan Freeman as Mandela opens in South Africa, Canada and the United States."]], ["2010-02-11 00:00:00", ["On the 20th anniversary of Mandela's release from prison tributes, commemorations and marches in his honor take place."]], ["2010-06-11 00:00:00", ["Mandela makes his first World Cup appearance before kickoff of the final match."]], ["2011-01-26 00:00:00", ["Is hospitalized in Johannesburg and treated for an acute respiratory infection."]], ["2011-06-21 00:00:00", ["Meets with US First Lady Michelle Obama at his home in South Africa."]], ["2012-02-25 00:00:00", ["Treated for an abdominal hernia."]], ["2012-12-08 00:00:00", ["Is admitted to the hospital, suffering a lung infection."]], ["2012-12-15 00:00:00", ["Undergoes successful endoscopic surgery to have gall stones removed."]], ["2013-01-06 00:00:00", ["A spokesman says Mandela has successfully recovered from surgery and a lung infection and is slowly getting back to his normal routine."]], ["2013-03-27 00:00:00", ["Is admitted to the hospital due to the recurrence of a lung infection."]], ["2013-04-06 00:00:00", ["Mandela is discharged from the hospital."]], ["2013-04-29 00:00:00", ["The South Africa Broadcasting Corporation (SABC) releases video of Mandela as he sits at home surrounded by South Africa President Jacob Zuma and other government officials.", "SABC and the African National Congress, which has been critical of media in the past, are accused of political exploitation."]], ["2013-06-08 00:00:00", []], ["2013-06-23 00:00:00", ["Officials say Mandela's condition has worsened in the past 24 hours, and he is now in critical condition."]], ["2013-08-31 00:00:00", ["Is discharged from the hospital to continue his recovery at home.  ", "According to President Zuma he is still listed in \"critical but stable condition but responding to treatment.\""]], ["2013-12-05 00:00:00", ["Mandela dies at his home in the Johannesburg suburb of Houghton.", "South African President Zuma orders all flags in the nation to be flown at half-staff through the state funeral."]], ["2013-12-15 00:00:00", ["Mandela is buried in his childhood village of Qunu."]]]
