[["1997-07-19 00:00:00", ["- Taylor is elected president of Liberia in a special election."]], ["2003-06-04 00:00:00", ["Taylor is indicted for crimes against humanity by a United Nations court.", "Charges include murder, enslavement and the recruitment of child soldiers."]], ["2003-06-06 00:00:00", ["- Rebels advance into Monrovia, the capital of Liberia."]], ["2003-08-07 00:00:00", ["- Taylor submits his letter of resignation."]], ["2003-08-11 00:00:00", ["Steps down as president, hands over power to Vice President Moses Blah and leaves for Nigeria, where he is granted asylum."]], ["2003-12-04 00:00:00", ["- Interpol puts out a global arrest warrant for Taylor."]], ["2006-03-16 00:00:00", ["- The indictment against Taylor is amended and reduced to 11 counts."]], ["2006-03-29 00:00:00", ["Taylor is recaptured and taken into custody by border guards in northern Nigeria as he tried to leave the country with his wife."]], ["2006-04-03 00:00:00", ["Taylor appears at a UN-backed tribunal in Sierra Leone and pleads not guilty to 11 war crimes charges."]], ["2006-06-20 00:00:00", ["Taylor is transferred to the Hague in the Netherlands for trial."]], ["2007-06-04 00:00:00", ["Taylor boycotts the opening of his trial, calling it a \"charade\" in a letter read by his attorney."]], ["2008-01-07 00:00:00", ["- Taylor appears in court as his war crimes trial resumes."]], ["2011-03-11 00:00:00", ["- Taylor's trial concludes."]], ["2012-04-26 00:00:00", ["Taylor is found guilty of aiding and abetting war crimes in Sierra Leone."]], ["2012-05-16 00:00:00", ["At a sentencing hearing, Taylor says that terrible things happened in Sierra Leone, for which there can be no justification, but his role in the conflict was much different than represented.", "\"I pushed the peace process hard, contrary to how I have been portrayed in this court.\""]], ["2012-05-30 00:00:00", ["Taylor is sentenced to 50 years in prison."]], ["2013-01-22 00:00:00", ["- Taylor's lawyers argue an appeal of Taylor's conviction for war crimes."]], ["2013-09-26 00:00:00", ["Taylor's appeal is dismissed, his sentence stands."]]]
