[["2005-11-07 00:00:00", ["Olmert is appointed Minister of Finance."]], ["2006-01-05 00:00:00", ["Is named Acting Prime Minister after Sharon suffers a stroke."]], ["2006-03-28 00:00:00", ["The Kadima party wins the largest number of parliamentary seats, ensuring that Olmert will be the next Prime Minister."]], ["2006-05-04 00:00:00", ["Is sworn in as the 12th Prime Minister of Israel."]], ["2006-05-26 00:00:00", ["Addresses a joint meeting of the US Congress."]], ["2008-07-30 00:00:00", ["Olmert announces he will resign as prime minister when Kadima elects a new chairman."]], ["2008-09-18 00:00:00", ["Tzipi Livni"]], ["2008-09-21 00:00:00", ["Resigns shortly after police recommend charges in corruption probes."]], ["2009-08-30 00:00:00", ["Is indicted on charges including fraud and breach of trust in dual scandals called the Talansky affair and the Rishon Tours affair.", "The trial begins in September 2009."]], ["2012-01-05 00:00:00", ["While on trial for fraud and breach of trust, Olmert is indicted for bribery in a separate case."]], ["2012-07-10 00:00:00", ["Olmert's trial ends after almost three years.", "He is found guilty of breach of trust and acquitted on two corruption charges.", "He receives a one year suspended jail sentence and is ordered to pay a fine of 75,000 shekels (about $19,000)."]], ["2014-03-31 00:00:00", ["Is convicted of bribery charges in a trial related to the Holyland Affair."]], ["2014-08-06 00:00:00", ["The Supreme Court orders a retrial in the Rishon Tours/Talansky case, as new evidence emerges, enabling prosecutors to challenge Olmert's acquittals on corruption charges in 2012."]], ["2015-03-30 00:00:00", ["Olmert is convicted of fraud and breach of trust in the retrial of the Rishon Tours/Talansky case.", "His total prison sentence for the Talansky/Rishon Tours case and the Holyland Affair is 27 months."]], ["2016-02-15 00:00:00", ["Olmert arrives at prison."]], ["2017-07-02 00:00:00", ["Olmert is released after serving 16 months, two-thirds of his original 27-month prison term."]]]
