[["2000-04-10 00:00:00", ["Becomes the first female chairperson of the CDU."]], ["2005-10-10 00:00:00", ["Strikes a deal with Gerhard Schroeder's Social Democrats that will make her the first female chancellor of Germany."]], ["2005-11-22 00:00:00", ["Is sworn in as the first female chancellor of Germany."]], ["2008-04-30 00:00:00", ["Receives the Charlemagne Prize, the \"Citizens' Prize for Services to European Unity.\""]], ["2009-06-26 00:00:00", ["Makes first visit to the United States under President Barack Obama's administration."]], ["2009-09-27 00:00:00", ["Is re-elected chancellor of Germany."]], ["2011-02-15 00:00:00", ["Receives the Presidential Medal of Freedom from Obama."]], ["2011-06-17 00:00:00", ["Meets with French President Nicholas Sarkozy to discuss a potential Greek bailout plan."]], ["2011-12-05 00:00:00", ["Meets with Sarkozy to announce their proposed plan to impose fiscal discipline on members of the European Union."]], ["2013-09-22 00:00:00", ["Is re-elected chancellor of Germany."]], ["2013-10-25 00:00:00", ["In the wake of reports that the US National Security Agency eavesdropped on her cell phone, an angry Merkel says, \"true change is necessary,\" and \"spying among friends is never acceptable.\""]], ["2013-12-17 00:00:00", ["Is sworn in for a third term as chancellor of Germany"]], ["2015-06-12 00:00:00", ["Germany's Federal Prosecutor's Office says it has dropped a probe into allegations by former NSA contractor Edward Snowden that the National Security Agency had bugged the phone of German Chancellor Angela Merkel.", "The office states there was insufficient evidence to launch a successful prosecution."]], ["2015-12-09 00:00:00", ["Is named Person of the Year by Time magazine."]], ["2017-03-17 00:00:00", ["Makes first visit to the United States under President Donald Trump's administration."]], ["2017-09-24 00:00:00", ["Merkel wins a fourth term as German Chancellor, but her party's lead in parliament is cut to 33.5%, and the country faces a surge in support for the far right."]], ["2018-03-04 00:00:00", ["The Social Democratic Party votes to renew a government coalition with Merkel's Christian Democrats, paving the way for her fourth term as chancellor and ending the almost half-year of political deadlock and painful negotiations."]], ["2018-04-27 00:00:00", ["Makes her second state visit to the US since Trump has been in office."]]]
