[["1986-02-19 00:00:00", ["Buys the AC Milan football club."]], ["1994-01-26 00:00:00", ["Resigns all his positions at Fininvest to enter politics, but still holds stock."]], ["1994-12-22 00:00:00", ["Is removed from office after losing the support of other political parties."]], ["2001-05-13 00:00:00", ["Wins the general election with 18.5 million votes to become prime minister of Italy."]], ["2004-02-10 00:00:00", ["Becomes the first leader to visit Libya since Moammar Gadhafi's promise to end development of weapons of mass destruction."]], ["2005-04-20 00:00:00", ["Resigns but is sworn in as the prime minister again after forming a new government three days later, on April 23."]], ["2006-03-10 00:00:00", ["Prosecutors decide that Berlusconi should be put on trial for judicial corruption."]], ["2006-04-09 00:00:00", ["Berlusconi squares off against Prodi in a general election.", "Early returns indicate Prodi is the winner."]], ["2006-04-19 00:00:00", ["The Italian Supreme Court confirms Prodi's election win, but Berlusconi doesn't concede and resign until May 2."]], ["2006-10-30 00:00:00", ["Berlusconi and British lawyer David Mills are ordered to stand trial on charges of tax fraud.", "Berlusconi is accused of paying Mills $600,000 in exchange for favorable testimony in two cases."]], ["2006-11-26 00:00:00", ["Faints while addressing a rally on live television.", "Doctors later state that he has an irregular heartbeat."]], ["2006-12-19 00:00:00", ["Receives a pacemaker at the Cleveland Clinic."]], ["2007-03-13 00:00:00", ["The tax fraud trial against Berlusconi and Mills begins.", "Both Mills and Berlusconi face prison terms from four to 12 years if convicted."]], ["2007-09-24 00:00:00", ["The trial is moved to London to aid witnesses who claim traveling to Italy would be too difficult."]], ["2008-02-21 00:00:00", ["Berlusconi's tax fraud trial is suspended until after the election."]], ["2008-04-14 00:00:00", ["Wins the Italian parliamentary elections to become prime minister for the third time."]], ["2008-05-08 00:00:00", ["Is sworn in."]], ["2009-10-07 00:00:00", ["Italy's Constitutional Court strikes down a 2008 law that would have given Berlusconi immunity from prosecution."]], ["2009-12-13 00:00:00", ["Berlusconi is attacked at a rally in Milan and suffers a broken nose and several broken teeth."]], ["2010-12-14 00:00:00", ["Survives parliamentary confidence vote in the lower house by three votes.", "The win sparks a demonstration in Rome where nearly 100 are injured."]], ["2011-01-14 00:00:00", ["Magistrates in Milan reveal they are investigating whether Berlusconi paid for sex with an underage girl and then abused his power by trying to cover it up."]], ["2011-02-15 00:00:00", ["An Italian judge rules that Berlusconi will be tried on charges of sex with an underage girl and abuse of power."]], ["2011-02-28 00:00:00", ["Tax fraud trial from 2007 resumes."]], ["2011-04-06 00:00:00", ["The trial for having sex with an underage girl begins."]], ["2011-11-08 00:00:00", ["Berlusconi says he will resign when the country's budget is confirmed by parliament."]], ["2011-11-12 00:00:00", ["Berlusconi resigns after the Italian legislature votes in favor of an austerity budget."]], ["2012-10-26 00:00:00", ["Is convicted of tax fraud, sentenced to four years in prison and barred from public office for five years.", "Berlusconi files an appeal and in 2014, his sentence is reduced to one year of community service at a nursing home."]], ["2013-06-24 00:00:00", ["Berlusconi is found guilty of having sex with an underage prostitute and abuse of power and is sentenced to seven years in prison.", "An appeals court overturns the conviction in July 2014."]], ["2013-11-27 00:00:00", ["The Italian Senate expels Berlusconi from Parliament with a vote of 192 to 113 (two senators abstained)."]], ["2015-07-08 00:00:00", ["Berlusconi is convicted of bribing a senator to change political factions.", "He is sentenced to three years in prison and banned from holding public office for five years.", "However, since the statute of limitations is due to expire before any appeals proceeding can take place, Berlusconi will not serve prison time."]], ["2016-06-07 00:00:00", ["Is hospitalized in Milan with a heart-related problem."]], ["2016-06-14 00:00:00", ["Undergoes heart surgery to replace an aortic valve."]], ["2017-04-13 00:00:00", ["Sells the AC Milan football club to Rossoneri Sport Investment Lux."]], ["2018-05-11 00:00:00", ["The Court of Milan grants Berlusconi \"rehabilitation,\" effectively lifting the ban on him re-entering politics that has been in place since his 2012 conviction for tax fraud.", "Under the so-called \"Severino Law,\" anyone sentenced to a jail term of more than two years is not allowed to run for public office."]]]
