[["2006-04-12 00:00:00", ["Signs health care legislation for Massachusetts."]], ["2007-01-03 00:00:00", ["Romney files papers with the FEC for an exploratory committee, the initial step toward running for president in 2008."]], ["2007-02-13 00:00:00", ["Officially announces his intention to run in the 2008 presidential election, in Dearborn, Michigan."]], ["2008-02-07 00:00:00", ["- Suspends his campaign after a disappointing showing in the Super Tuesday primaries and caucuses."]], ["2008-02-14 00:00:00", ["- Endorses John McCain for president and encourages his 286 delegates to support McCain."]], ["2010-03-02 00:00:00", ["- Romney's book, \"No Apology:", "The Case for American Greatness,\" is published."]], ["2011-04-11 00:00:00", ["In a YouTube video, Romney announces that he's formed an exploratory committee in his second run for the White House."]], ["2011-06-02 00:00:00", ["Romney officially announces his candidacy for president, from a family farm in Stratham, New Hampshire."]], ["2011-09-06 00:00:00", ["- Announces his job creation plan for America."]], ["2012-01-24 00:00:00", ["Romney's campaign releases tax documents showing Romney made $42.7 million over the past two years and paid $6.2 million in taxes."]], ["2012-08-11 00:00:00", ["- Announces Wisconsin Congressman Paul Ryan as his running mate."]], ["2012-08-30 00:00:00", ["Gives his acceptance speech at the Republican National Convention in Tampa, Florida."]], ["2012-09-16 00:00:00", ["- Video is released"]], ["2012-09-21 00:00:00", ["- Releases his 2011 income tax return.", "The documents show Romney made $13.7 million and paid $1.94 million in taxes, a tax rate of 14.1%."]], ["2012-11-06 00:00:00", ["- Defeated in the general election by President Barack Obama.", "Romney wins 206 Electoral College votes to Obama's 332."]], ["2012-12-03 00:00:00", ["- Romney rejoins the board of directors of Marriott International, Inc."]], ["2015-01-30 00:00:00", ["Romney tells supporters he will not make a third run for president,"]], ["2016-03-04 00:00:00", ["Tells NBC's Matt Lauer on the \"Today\" show he will not make an 11th-hour presidential run"]], ["2018-01-08 00:00:00", ["A source close to Romney tells CNN Romney was treated for prostate cancer over the summer. \"", "He was treated surgically by Dr. Thomas Ahlering at UC Irvine Hospital in California,\" the source said.", "\"His prognosis is good; he was successfully treated.\""]], ["2018-02-16 00:00:00", ["Romney announces that he is running for the US Senate from Utah."]], ["2018-06-26 00:00:00", ["Wins the Republican Senate primary in Utah."]], ["2018-11-06 00:00:00", ["Wins the US Senate race in Utah, defeating Jenny Wilson.", "He succeeds Sen. Orrin Hatch, who is retiring after nearly 40 years in the Senate."]]]
